Repository: LongLong2310/Mine-IOS-Casino-Game
Catalog: Mine Game/Utilities/Localization/*.lproj/Localizable.strings
Languages: es, vi

source: Game Settings
es: Configuración del juego
vi: Cài Đặt Trò Chơi

source: Dark Mode
es: Modo oscuro
vi: Chế Độ Tối

source: Sound
es: Sonido
vi: Âm Thanh

source: Music
es: Música
vi: Âm Nhạc

source: Language:
es: Idioma:
vi: Ngôn Ngữ:

# Easy Description
source: In Easy mode, users can choose from 0 to 25 mines and have higher winning chances.
es: En el modo Fácil, los jugadores pueden elegir entre 0 y 25 minas y tienen más posibilidades de ganar.
vi: Ở chế độ Dễ, người chơi có thể chọn từ 0 đến 25 mìn và có cơ hội thắng cao hơn.

# Medium Description
source: Medium mode offers a balanced challenge with a moderate number of mines (from 10 to 25 mines).
es: El modo Medio ofrece un desafío equilibrado con una cantidad moderada de minas (de 10 a 25 minas).
vi: Chế độ Trung bình mang đến thách thức cân đối với số lượng mìn trung bình (từ 10 đến 25 mìn).

# Hard Description
source: Hard mode is for experienced players, with more mines and higher risks (from 20 - 25 mines).
es: El modo Difícil es para jugadores experimentados, con más minas y riesgos más altos (de 20 a 25 minas).
vi: Chế độ Khó dành cho người chơi có kinh nghiệm, với nhiều mìn hơn và rủi ro cao hơn (từ 20 - 25 mìn).

source: Continue
es: Continuar
vi: Tiếp Tục

source: Play Game
es: Jugar
vi: Chơi Game

source: How To Play
es: Cómo Jugar
vi: Cách Chơi

source: Welcome to the Mine Game!
es: ¡Bienvenido al Juego de Minas!
vi: Chào mừng bạn đến với trò chơi Mìn!

source: Objective:
es: Objetivo:
vi: Mục Tiêu:

source: Your goal is to find all the diamonds hidden on the grid while avoiding hitting any mines.
es: Tu objetivo es encontrar todos los diamantes ocultos en la cuadrícula sin golpear ninguna mina.
vi: Mục tiêu của bạn là tìm tất cả các viên kim cương ẩn trong lưới mà không va vào bất kỳ mìn nào.

source: Game Rules:
es: Reglas del Juego:
vi: Quy tắc trò chơi:

source: 1. Enter your bet amount and the number of mines you want to play with.
es: 1. Ingresa la cantidad de tu apuesta y el número de minas con las que deseas jugar.
vi: 1. Nhập số tiền cược và số lượng mìn bạn muốn chơi.

source: 2. Tap on the cells to reveal their contents.
es: 2. Toca las celdas para revelar su contenido.
vi: 2. Nhấn vào các ô để hiển thị nội dung bên trong.

source: 3. If you reveal a diamond, you'll earn a profit based on your bet amount and the profit rate.
es: 3. Si revelas un diamante, ganarás un beneficio basado en la cantidad de tu apuesta y la tasa de beneficio.
vi: 3. Nếu bạn khám phá một viên kim cương, bạn sẽ kiếm được lợi nhuận dựa trên số tiền cược và tỷ lệ lợi nhuận.

source: 4. If you reveal a mine, the game is over, and you'll lose your bet amount.
es: 4. Si revelas una mina, el juego termina y perderás la cantidad de tu apuesta.
vi: 4. Nếu bạn khám phá một viên mìn, trò chơi kết thúc và bạn sẽ mất số tiền cược của bạn.

source: 5. The profit rate increases after each successful diamond reveal.
es: 5. La tasa de beneficio aumenta después de cada revelación exitosa de un diamante.
vi: 5. Tỷ lệ lợi nhuận tăng sau mỗi lần khám phá kim cương thành công.

source: 6. If you reveal all diamonds without hitting a mine, you win the game and earn the profit.
es: 6. Si revelas todos los diamantes sin golpear una mina, ganas el juego y obtienes el beneficio.
vi: 6. Nếu bạn khám phá tất cả các viên kim cương mà không va vào mìn, bạn sẽ thắng cuộc và kiếm được lợi nhuận.

source: Tips:
es: Consejos:
vi: Mẹo:

source: 1. Start with a smaller bet amount and gradually increase it as you get comfortable with the game.
es: 1. Comienza con una cantidad de apuesta más pequeña y aumenta gradualmente a medida que te sientas cómodo con el juego.
vi: 1. Bắt đầu với số tiền cược nhỏ và từ từ tăng lên khi bạn cảm thấy thoải mái với trò chơi.

source: 2. Be strategic in your choices to maximize your profits and minimize the risks.
es: 2. Sé estratégico en tus elecciones para maximizar tus beneficios y minimizar los riesgos.
vi: 2. Hãy chiến lược trong lựa chọn của bạn để tối đa hóa lợi nhuận và giảm thiểu các rủi ro.

source: Leaderboard
es: Clasificación
vi: Bảng xếp hạng

source: Achievement Badges
es: Insignias de Logro
vi: Huy hiệu

source: Gameplay Statistics
es: Estadísticas de Juego
vi: Thống kê trò chơi

# betAmountLabel
source: Bet Amount
es: Monto de apuesta
vi: Số tiền cược

# minBetMessage
source: Min bet is: %d
es: La apuesta mínima es: %d
vi: Cược tối thiểu là: %d

# minesLabel
source: Mines
es: Minas
vi: Mìn

# minMinesMessage
source: Min mines is: %d
es: El mínimo de minas es: %d
vi: Số mìn tối thiểu là: %d

# totalProfitLabel
source: Total Profit:
es: Ganancia total:
vi: Tổng lợi nhuận:

# profitRateLabel
source: Profit Rate:
es: Tasa de ganancia:
vi: Tỷ lệ lợi nhuận:

# cashoutButton
source: Cashout
es: Cobrar
vi: Rút tiền

# betButton
source: Bet
es: Apostar
vi: Cược

# gameOverMessage
source: Game Over
es: Fin del juego
vi: Kết thúc trò chơi

# youWinMessage
source: You Win
es: ¡Ganaste!
vi: Bạn thắng!

# youEarnMessage
source: You earn %.2f
es: Ganaste %.2f
vi: Bạn kiếm được %.2f

# betMinChangedMessage
source: Bet min has changed
es: La apuesta mínima ha cambiado
vi: Cược tối thiểu đã thay đổi

# continueButton
source: Continue
es: Continuar
vi: Tiếp tục

# earnedNewAchievementMessage
source: You earned new achievement
es: Has obtenido un nuevo logro
vi: Bạn đã đạt được thành tích mới
